package duth.ui_ux.quizapp;

public class QuestionAnswer {
    public static String[] question = {
            "Η Βιωσιμότητα επιτυγχάνεται όταν παράγουμε κάτι ξοδεύοντας...",
            "Για να αντιμετωπιστεί το πρόβλημα των Ζιζανίων:",
            "Ανανεώσιμες Πηγές Ενέργειας προέρχονται από:",
            "Τα Φωτοβολταϊκά Πάνελ:",
            "Αειφορία είναι όταν χρησιμοποιείται κάποιο φυσικό στοιχείο ενός τόπου:",
            "Η Κοπή Δέντρων σε δάσος πρέπει να γίνεται:",
            "Είναι επιτυχής η Ανακύκλωση όταν:",
            "Τα υλικά για Ανακύκλωση:",
            "Βιοκλιματικός Σχεδιασμός είναι ο σχεδιασμός κτιρίων και χώρων (εσωτερικών και εξωτερικών – υπαίθριων):",
            "Μία αποθήκη για να έχει Σχετική Δροσιά το Καλοκαίρι πρέπει να:"
    };

    public static String[][] choices = {
            {
                    "Λίγα, με καλύτερο αποτέλεσμα για τον άνθρωπο και το περιβάλλον, τώρα και για το μέλλον",
                    "Αρκετά, με αποτέλεσμα τη μέγιστη ποσότητα παραγωγής και την υπερκάλυψη των ανθρώπινων αναγκών",
                    "Πολλά, με αποτέλεσμα την καλύτερη ποιότητα των προϊόντων και την αντοχή τους στο χρόνο",
                    "Λίγα, με ικανοποιητική κάλυψη της τωρινών αναγκών του ανθρώπου"
            },
            {
                    "Καλύπτουμε το έδαφος του χωραφιού με κατάλοιπα άλλων καλλιεργειών, ώστε να μην φυτρώσουν ζιζάνια",
                    "Εάν εμφανιστούν, εφαρμόζουμε στην καλλιέργεια ζιζανιοκτόνο για να τα εξοντώσει",
                    "Εάν εμφανιστούν, τα αφήνουμε να μεγαλώσουν με την καλλιέργεια και τα διαχωρίζουμε κατά τη συγκομιδή",
                    "Εφαρμόζουμε ζιζανιοκτόνο στο χωράφι πριν την σπορά για να είμαστε σίγουροι ότι δεν θα φυτρώσουν"
            },
            {
                    "Τον άνεμο, τον ήλιο, τη γεωθερμία, τη κυκλοφορία του νερού τη βιομάζα και άλλες",
                    "Τα ορυκτά καύσιμα, όπως το κάρβουνο, το πετρέλαιο και το φυσικό αέριο",
                    "Την καύση οικιακών σκουπιδιών",
                    "Λιγνίτη"
            },
            {
                    "Καλό είναι να τοποθετηθούν σε οροφές θερμοκηπίων, αλλά και σε ανοιχτές καλλιέργειες για ενεργειακή αυτονομία και διαχείριση λειτουργιών",
                    "Δεν συστήνεται η τοποθέτηση τους σε οροφές θερμοκηπίων, αλλά και σε ανοιχτές καλλιέργειες, γιατί είναι ασύμφορη οικονομικά, χωρίς ουσιώδες όφελος",
                    "Παράγουν ενέργεια περιστασιακά και δεν συστήνονται για ιδιωτική χρήση",
                    "Παράγουν ενέργεια επιβαρύνοντας το περιβάλλον, αλλά δεν πρέπει να λαμβάνεται υπόψη γιατί το όφελος είναι μεγαλύτερο"
            },
            {
                    "Με τέτοιο τρόπο ώστε να καλύψει τις τωρινές ανάγκες των ανθρώπων, αλλά και των μελλοντικών γενεών και να βελτιώσει την ποιότητα ζωής τους",
                    "Με στόχο να υπερκαλύψει τις τωρινές ανάγκες των ανθρώπων, αυξάνοντας το βιοτικό επίπεδο τους",
                    "Μέχρι εξαντλήσεως, ώστε να χρησιμοποιήσει η επόμενη γενιά κάποιο άλλο φυσικό στοιχείο εξ ολοκλήρου",
                    "Πάντα κατά το ήμισυ"
            },
            {
                    "Με προσοχή , διαλέγοντάς τα περισσότερο ξερά δέντρα σε απόσταση μεταξύ τους και χωρίς τη χρήση βαρειών μηχανημάτων, ώστε να διαταραχτεί ελάχιστα η ζωή του",
                    "Περιμετρικά του οικισμού σε ζώνη βάθους 10 μέτρων",
                    "Σε κυκλικές εκτάσεις διαμέτρου 100 μέτρων στο κέντρο του δάσους",
                    "Σε εκτάσεις που έχουν πρόσβαση τα μηχανήματα"
            },
            {
                    "Επαναχρησιμοποιούνται διάφορα υλικά ή οτιδήποτε δεν αποτελεί πλέον αγαθό για τον άνθρωπο, απορρίμματα που μετατρέπονται σε πρώτες ύλες από τις οποίες παράγονται νέα προϊόντα λιγότερο βλαβερά για το περιβάλλον",
                    "Επαναχρησιμοποιούνται διάφορα υλικά που είναι παρόμοια στο υλικό και στο μέγεθος, με σκοπού τη παραγωγή συγγενικού προϊόντος, μοντέρνου σχήματος και με διακοσμητική χρήση",
                    "Σε απομακρυσμένες περιοχές στοιβάζονται παρόμοια υλικά και όταν με το πέρασμα του χρόνου αποσυντίθενται ή συρρικνώνονται, χρησιμοποιούνται για καύσιμη ύλη",
                    "Διάφορα υλικά λιώνουν σε πολύ υψηλές θερμοκρασίες, και τελικά χρησιμοποιούνται στην κατασκευή σωλήνων, τούβλων, κ.α"
            },
            {
                    "Τα διαχωρίζουμε και τα ρίχνουμε στους μπλε κάδους που βλέπουμε δίπλα στο δρόμο σε κάθε γειτονιά",
                    "Τα ρίχνουμε με τα οικιακά απορρίμματα στους κάδους σκουπιδιών που βλέπουμε δίπλα στο δρόμο σε κάθε γειτονιά",
                    "Τα συμπιέζουμε στο σπίτι σε οικιακές συσκευές και τα στοιβάζουμε μπροστά στις κατοικίες δίπλα στο δρόμο",
                    "Τα διαχωρίζουμε σε πλαστικές σακούλες και τα ρίχνουμε στους κάδους σκουπιδιών που βλέπουμε δίπλα στο δρόμο σε κάθε γειτονιά"
            },
            {
                    "Με σκοπό να δροσίζονται και να ζεσταίνονται με παθητικά συστήματα",
                    "Με σκοπό να προστατεύει τη σοδιά από άσχημες καιρικές συνθήκες, όπως βροχή και χαλάζι",
                    "Με σκοπό να διατηρούνται σταθερές θερμοκρασίες στο εσωτερικό",
                    "Στα οποία σχεδιάζεται και τοποθετούνται μηχανήματα ψύξης – θέρμανσης"
            },
            {
                    "Έχει ανοίγματα στο βορά και στο νότο, ώστε να δημιουργείτε εσωτερικό ρεύμα αέρα",
                    "Έχει ανεμιστήρες οροφής",
                    "Μην έχει καθόλου ανοίγματα",
                    "Καταβρέχεται εξωτερικά"
            }
    };

    public static int[] correctAnswers = {
            0,0,0,0,0,0,0,0,0,0,
    };
}

